/**
 * @file       GlobalAppConfig.h
 * @brief      根据应用程序的使用情况配置全局编译开关
 * @details    根据需要调整启用的编译开关
 * @author     HuaYi_Sir
 * @date       2020-09-21
 * @version    V1.0
 * @copyright  Copyright (c) 2018-2020 骅懿嵌入式
 *******************************************************************************************
 * @attention
 * 硬件平台: STM32F407
 * @par 修改日志:
 * <table>
 * <tr><th>Date        <th>Version   <th>Author    <th>Description
 * <tr><td>2020/09/21  <td>V1.0      <td>HuaYi_Sir <td>创建初始版本
 * </table>
 * 
 ********************************************************************************************
 */
#ifndef GLOBAL_APP_CONFIG__H_
#define GLOBAL_APP_CONFIG__H_

/*
文件引用
====================================================================================================
宏定义
*/

/**
 * @brief MCU类型定义
 */
//#define _MCU_MSP430F2XXX_
//#define _MCU_MSP430F4XXX_
//#define _MCU_MSP430F5XXX_
//#define _MCU_MSP430F6XXX_

//#define _MCU_STM32F0XXX_
//#define _MCU_STM32F1XXX_
//#define _MCU_STM32F4XXX_
#define _MCU_STM32L0XXX_
//#define _MCU_STM32L1XXX_
//#define _MCU_STM32L4XXX_

#define _DIS_GAS_SNSR_ZEOR_TRACK_     /*禁用0点跟踪功能*/
#define _DIS_GAS_SNSR_TMP_COMPENSATE_ /*禁用温度补偿功能*/

/**
 * @brief 时钟频率重定义
 */
#define CLK_FREQ_CORE_HZ      32000000  /*!< MCU内核时钟频率(Hz) */
#define CLK_FREQ_PERIP1_HZ    32000000  /*!< 外设时钟1频率(Hz) */
#define CLK_FREQ_PERIP2_HZ    32000000  /*!< 外设时钟2频率(Hz) */
#define CLK_FREQ_WDT_HZ       32768     /*!< 看门狗定时钟频率(Hz) */
#define CLK_FREQ_BASIC_HZ     8000000   /*!< 时钟源基准频率,对应外部晶体或内部基准(Hz) */

/*
宏定义
====================================================================================================
格式声明
*/

/*
格式声明
====================================================================================================
函数声明
*/

/*
函数声明
====================================================================================================
外部变量
*/

/*
外部变量
====================================================================================================
变量定义
*/

/*
变量定义
====================================================================================================
内部函数
*/

/*
内部函数
====================================================================================================
外部函数
*/
#endif
